Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: These are animals.
kw: An re ma yw enevales.

source: This bed is heavy.
kw: Poos yw an gweli ma.

source: This day is Friday.
kw: An jydh ma yw dy Gwener.

source: This is cold.
kw: Yeyn yw hemma.

source: This is my brother.
kw: Hemm yw ow broder.

source: This is ugly.
kw: Hager yw hemma.

source: I am very hungry.
kw: Yma nown bras dhymm.

source: This table is wooden.
kw: Prenn yw an voos ma.

source: We study Arabic.
kw: Ni a studh Arabek.

source: We will have to do something.
kw: Res vydh dhyn gul neppyth.

source: Well done!
kw: Gwrys yn ta!

source: What color is your hair?
kw: Py liw yw ow gols?

source: What is that?
kw: Pyth yw henna?

source: She's my sister.
kw: Ow hwor yw hi.

source: Do you have any sisters?
kw: Eus dhis hwerydh?

source: That's my cat.
kw: Honn yw ow hath.

source: That is my dictionary.
kw: Henn yw ow gerlyver.

source: Where is Britney Spears?
kw: Ple’ma Britney Spears?

source: I didn't want to catch a cold, so I didn't go out.
kw: Ny vynnen anwosi, ytho nyns yth yn-mes.

source: Will it rain tomorrow?
kw: A vydh hi glaw a-vorow?

source: The sun is red.
kw: Rudh yw an howl.

source: Where is his house?
kw: Ple’ma y ji?

source: Where is her house?
kw: Ple’ma hy chi?

source: Where is my book?
kw: Ple’ma ow lyver?

source: You can't swim here.
kw: Ny yll'ta neuvya omma.

source: I must help my mother.
kw: Res yw dhymm gweres ow mamm.

source: I must go now.
kw: Res yw dhymm mos lemmyn.

source: Cheers!
kw: Yeghes da!

source: She likes these cats.
kw: Da yw gensi an gathes ma.

source: It's raining outside.
kw: Yma hi ow kul glaw yn-mes.

source: I'm trying to remember.
kw: Yth esov vy owth assaya perthi kov.

source: The dog is mine.
kw: Yma’n ki dhymmo vy.

source: She lives nearby.
kw: Trigys yw yn ogas.

source: I'm going.
kw: Yth esov vy ow mos.

source: Do you need to work on Sunday?
kw: Yw res dhis oberi dy Sul?

source: She didn't need to do that work.
kw: Nyns o res dhedhi gul an ober na.

source: See you tomorrow.
kw: Dha weles a-vorow.

source: He fooled her.
kw: Ev a’s tollas.

source: Good afternoon.
kw: Dohajydh da!

source: It is a small dog.
kw: Ki byghan yw.

source: He doesn't need to work.
kw: Nyns yw res dhodho oberi.

source: Don't worry.
kw: Na borth ahwer.

source: I don't understand this.
kw: Ny gonvedhav hemma.

source: I don't believe in God.
kw: Ny grysav yn Duw.

source: It's raining again!
kw: Yma hi ow kul glaw arta!

source: I have a cat and a dog. The cat's black and the dog's white.
kw: Yma dhymm kath ha ki. Du yw an gath ha gwynn yw an ki.

source: Where's the bank?
kw: Ple'ma'n arghantti?

source: My name is Farshad.
kw: Farshad yw ow hanow.

source: I'm retired.
kw: Omdennys ov.

source: What will you make?
kw: Pandr’a vyn’ta dhe wul?

source: That's a book.
kw: Lyver yw henna.

source: This book was easy.
kw: An lyver-ma o es.

source: Today is Monday.
kw: dy'Lun yw hedhyw.

source: Is my answer correct?
kw: Yw ow gorthyp ewn?

source: No, I didn't write it.
kw: Na skrifis, ny’n skrifis.

source: Goodbye!
kw: Farwell dhis!

source: I saw him.
kw: My a’n gwelas.

source: And you?
kw: Ha ty?

source: I don't like cold coffee.
kw: Nyns yw da genev koffi yeyn.

source: The dog is white.
kw: Gwynn yw an ki.

source: He likes to listen to the radio.
kw: Da yw ganso goslowes orth an radyo.

source: I can't remember now.
kw: Ny allav vy perthi kov lemmyn.

source: What will you do?
kw: Pandr’a vyn’ta dhe wul?

source: I hate my neighbors.
kw: Kas yw genev ow hentrevogyon.

source: I'm tired!
kw: Skwith ov vy!

source: I want to buy.
kw: My a vynn prena.

source: Mr. Johnson's room was a large one.
kw: Stevel Mr Johnson o onan vras.

source: Hi.
kw: Hou.

source: I am trying to learn English.
kw: Yth esov vy owth assaya dyski Sowsnek.

source: Where is the station?
kw: Ple'ma an gorsav?

source: She can speak Spanish.
kw: Hi a wor kewsel Spaynek.

source: Ken has two cats.
kw: Yma diw gath dhe Ken.

source: I don't like bad children.
kw: Nyns yw da genev fleghes drog.

source: I can't remember.
kw: Ny allav vy perthi kov.

source: It is not easy to speak English.
kw: Nyns yw es kewsel Sowsnek.

source: This is my sister.
kw: Homm yw ow whor.

source: This is a car.
kw: Karr yw hemma.

source: Come quickly.
kw: Deus yn skon.

source: I'm a student.
kw: Studhyer ov.

source: Do you like white chocolate?
kw: Yw da genes choklet gwynn?

source: Shishir is following me.
kw: Yma Shishir orth ow holya.

source: This book is too expensive for me.
kw: An lyver-ma yw re gostek ragov.

source: I see a lion.
kw: My a wel lion.

source: The house is cold.
kw: Yeyn yw yn chi.

source: I don't like eggs.
kw: Nyns yw da genev oyow.

source: I dislike eggs.
kw: Drog yw genev oyow.

source: It's snowing today.
kw: Yma ow kul ergh hedhyw.

source: He is running.
kw: Yma va ow ponya.

source: Is that your car?
kw: Yw henna dha garr?

source: Don't forget to write me.
kw: Na wra ankevi skrifa dhymm.

source: Pardon me, please.
kw: Gav dhymm, mar pleg.

source: You didn't need to buy the book.
kw: Nyns o res dhis prena an lyver.

source: I can't talk.
kw: Ny allav vy kewsel.

source: Can I speak with Judy?
kw: A allav vy kewsel orth Judy?

source: It's one o'clock.
kw: Unn eur yw.

source: That was good.
kw: Da o henna.

source: I am going, too.
kw: Yth esov vy ow mos, ynwedh.

source: Did you like that?
kw: O da genes henna?

source: Do you know?
kw: A wodhes?

source: That is wet.
kw: Henn yw glyb.

source: Ten, twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, hundred.
kw: Deg, ugens, deg warn ugens, dew-ugens, deg ha dew-ugens, tri-ugens, deg ha tri-ugens, peswar-ugens, deg ha peswar-ugens, kans.

source: I love you, too.
kw: My a’th kar ynwedh.

source: These apples are big.
kw: An avalow ma yw bras.

source: That book is small.
kw: Byghan yw an lyver na.

source: Ten, twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, one hundred.
kw: Deg, ugens, deg warn ugens, dew-ugens, deg ha dew-ugens, tri-ugens, deg ha tri-ugens, peswar-ugens, deg ha peswar-ugens, kans.

source: She has seven sons.
kw: Yma dhedhi seyth mab.

source: What book did you buy?
kw: Py lyver a brensys?

source: You must read this book.
kw: Res yw dhis redya an lyver ma.

source: She likes ice cream.
kw: Da yw gensi dehen rew.

source: The baby was naked.
kw: Noth o an baban.

source: I'm reading The New York Times.
kw: Yth esov ow redya an New York Times.

source: Give me the key.
kw: Ro dhymm an alhwedh.

source: Today is Saturday.
kw: dy'Sadorn yw hedhyw.

source: I want to believe.
kw: My a vynn krysi.

source: I am learning Basque.
kw: Yth esov vy ow tyski Baskek.

source: This is my father.
kw: Hemm yw ow thas.

source: I am not eating.
kw: Nyns esov vy ow tybri.

source: She wants to dance.
kw: Hi a vynn donsya.

source: He ran.
kw: Ev a wrug ponya.

source: You run.
kw: Ty a boon.

source: He runs.
kw: Ev a bonyas.

source: She runs.
kw: Hi a bon.

source: I'm loved.
kw: Kerys ov.

source: I don't like this place.
kw: Nyns yw da genev an le ma.

source: I hate this place.
kw: Kas yw genev an le ma.

source: The goldfish is alive.
kw: Byw yw an owrbysk.

source: What's your answer?
kw: Pyth yw dha worthyp?

source: They like to dance.
kw: Da yw gansa donsya.

source: Mary needs a dozen eggs.
kw: Yma edhom dhe Varia a dhewdhek oy.

source: What kind of dog is that?
kw: Py par ki yw henna?

source: The weather is beautiful today.
kw: Teg yw an gewer hedhyw.

source: Is this true?
kw: Yw hemma gwir?

source: Do you have money?
kw: Eus arghans dhis?

source: What will the weather be like tomorrow?
kw: Fatel vydh an gewer a-vorow?

source: What's the weather like today?
kw: Fatel yw an gewer hedhyw?

source: Where is a bakery?
kw: Ple'ma popti?

source: Where is it?
kw: Ple’ma va?

source: Who are those children?
kw: Piw yw an fleghes na?

source: Why are you drinking water?
kw: Prag yth es’ta owth eva dowr?

source: Write soon!
kw: Skrif yn skon!

source: Write Spanish.
kw: Skrif Spaynek.

source: Why is my bag empty?
kw: Prag yth yw ow sagh gwag?

source: I still need to eat breakfast.
kw: Res yw dhymm hwath dybri hansel.

source: I like to travel.
kw: Da yw genev viajya.

source: Who teaches you?
kw: Piw a dhysk dhywgh?

source: The father is very tired.
kw: Pur skwith yw an tas.

source: I was baking a cake.
kw: Yth esen ow pobas tesen.

source: Ingo loves her.
kw: Ingo a’s kar.

source: I'll call him.
kw: My a vynn y elwel.

source: Do you like this flower?
kw: Yw da genes an vleujen ma?

source: Where is he?
kw: Ple’ma va?

source: I saw the dog.
kw: My a welas an ki.

source: Is this French?
kw: Yw hemma frynkek?

source: This is new.
kw: Nowydh yw homma.

source: I love to travel.
kw: My a gar viajya.

source: I have a new bicycle.
kw: Yma dhymm diwros nowydh.

source: Do you like this garden?
kw: Yw da genes an lowarth ma?

source: Where is the rain?
kw: Ple'ma'n glaw?

source: I have to hurry!
kw: Res yw dhymm fistena!

source: It's raining again.
kw: Yma hi ow kul glaw arta.

source: Do you like to sing?
kw: Yw da genes kana?

source: Wait five minutes, please.
kw: Gorta pymp mynysen, mar pleg.

source: She likes chocolate, too.
kw: Da yw gensi choklet, ynwedh.

source: If I had time, I could help you.
kw: Mar pe termyn genev, my a allsa dha weres.

source: I understand you.
kw: My a’gas konvedh.

source: Do we have to take the bus?
kw: Yw res dhyn kemeres an kyttrin?

source: I had to study English.
kw: Res o dhymm studhya Sowsnek.

source: What do you look like?
kw: Py semlans eus genes?

source: Does he like oranges?
kw: Yw da ganso owravalow?

source: Do you like oranges?
kw: Yw da genes owravalow?

source: Do they like oranges?
kw: Yw da gansa owravalow?

source: We started at six.
kw: Ni a dhallathas dhe hwegh eur.

source: How was the weather yesterday?
kw: Fatel o an gewer de?

source: What was the weather like?
kw: Fatel o an gewer?

source: She's my daughter.
kw: Ow myrgh yw hi.

source: She is my daughter.
kw: Ow myrgh yw hi.

source: I hate my neighbour.
kw: Kas yw genev ow hentrevek.

source: He was thirsty.
kw: Yth esa seghes dhodho.

source: Where does your grandfather live?
kw: Ple’th yw trigys dha das gwynn?

source: These are pens.
kw: An re ma yw pluvennow.

source: The weather is nice tonight.
kw: Da yw an gewer haneth.

source: I am a woman.
kw: Benyn ov vy.

source: You must answer the question.
kw: Res yw dhis gorthebi an govyn.

source: Speak slower, please.
kw: Kows lenta, mar pleg.

source: She's thirty-three.
kw: Tredhek bloodh warn ugens yw hi.

source: I study.
kw: My a studh.

source: She's giving each child two apples.
kw: Yma hi ow ri dhe bub flogh dew aval.

source: What'll you do tomorrow?
kw: Pandr’a vyn’ta dhe wul a-vorow?

source: Who wrote that letter?
kw: Piw a skrifas an lyther na?

source: I walk.
kw: My a gerdh.

source: It isn't a hospital.
kw: Nyns yw klavji.

source: What's the time?
kw: Py eur yw?

source: He's my brother.
kw: Ow broder yw ev.

source: I love my mother.
kw: My a gar ow mamm.

source: They left early.
kw: I a dhibarthas a-varr.

source: This is your house.
kw: Hemm yw dha ji.

source: My friend is seventeen years old.
kw: Seytek bloodh yw ow hothman.

source: My friend is seventeen.
kw: Seytek bloodh yw ow hothman.

source: That car is his.
kw: Ev a bew an karr-tan na.

source: I would like to have some more water.
kw: My a garsa kavos nebes moy a dhowr.

source: The boy eats bread.
kw: An maw a dheber bara.

source: I cannot see it.
kw: Ny allav vy y weles.

source: You must do it.
kw: Res yw dhis y wul.

source: I like to write here.
kw: Da yw genev skrifa omma.

source: What's her name?
kw: Pyth yw hy hanow?

source: We were reading a book and it was a very good one.
kw: Yth esen ow redya lyver hag onan pur dha o va.

source: I like to eat.
kw: Da yw genev dybri.

source: Yes, I am married.
kw: Ov, demedhys ov.

source: Is that your house?
kw: Yw henna dha ji?

source: I'm going home.
kw: Yth esov vy ow mos tre.

source: Do you have a sister, Juan?
kw: Eus dhis hwor, Juan?

source: I don't have four brothers.
kw: Nyns eus peswar broder dhymm.

source: I don't have four sisters.
kw: Nyns eus peder hwor dhymm.

source: Don't come.
kw: Na wra dos.

source: Don't go.
kw: Na wra mos.

source: He does not like us.
kw: Nyns on da ganso.

source: I love him.
kw: My a’n kar.

source: It's raining here.
kw: Yma hi ow kul glaw omma.

source: It's snowing here.
kw: Yma hi ow kul ergh omma.

source: It rains there.
kw: Hi a wra glaw ena.

source: It's raining there.
kw: Yma hi ow kul glaw ena.

source: It's snowing there.
kw: Yma hi ow kul ergh ena.

source: I can't.
kw: Ny allav.

source: I'm so tired.
kw: Ass ov vy skwith!

source: I don't like spring.
kw: Nyns yw da genev gwenton.

source: I prefer coffee.
kw: Gwell yw genev koffi.

source: I'm eating lunch.
kw: Yth esov vy ow tybri li.

source: He has come!
kw: Ev re dheuth!

source: This is the last train.
kw: Hemm yw an diwettha tren.

source: I like spring.
kw: Da yw genev gwenton.

source: It's difficult to read kanji.
kw: Kales yw redya kanji.

source: He used to drink beer.
kw: Ev a wre eva korev.

source: She used to drink beer.
kw: Hi a wre eva korev.

source: She's beautiful.
kw: Teg yw hi.

source: Is the sky blue? Yes.
kw: Yw an ebron glas? Yw.

source: It was extremely cold.
kw: Pur yeyn o.

source: I met my friend.
kw: My a vetyas orth ow hothman.

source: I wanted five pineapples.
kw: My a vynnas pymp pinaval.

source: She has a white cat.
kw: Yma dhedhi kath wynn.

source: Do I have to open the window?
kw: Yw res dhymm ygeri an fenester?

source: May I speak with Judy?
kw: A allav vy kewsel orth Judy?

source: The weather is cold now.
kw: Yeyn yw an gewer lemmyn.

source: I can't see!
kw: Ny allav vy gweles!

source: I was doing my homework.
kw: Yth esen vy ow kul ow ober tre.

source: I've been writing letters.
kw: My re bia ow skrifa lytherow.

source: Is that your book?
kw: Yw hemma dha lyver?

source: She came.
kw: Hi a dheudh.

source: He came.
kw: Ev a dheudh.

source: That is her car.
kw: Henn yw hy harr.

source: The man is eating bread.
kw: Yma’n den ow tybri bara.

source: I am not working.
kw: Nyns esov vy owth oberi.

source: I am not studying.
kw: Nyns esov vy ow studhya.

source: I want coffee.
kw: My a vynn kavos koffi.

source: The weather is bad today.
kw: Drog yw an gewer hedhyw.

source: I am very tired.
kw: Pur skwith ov vy.

source: Must I go with you?
kw: Yw res dhymm mos genes?

source: Good day!
kw: Dydh da!

source: Alas.
kw: Ogh.

source: I am coming today.
kw: Yth esov vy ow tos hedhyw.

source: I see the dog.
kw: My a wel an ki.

source: You're beautiful.
kw: Teg os ta.

source: I hate these words.
kw: Kas yw genev an geryow ma.

source: "Is she young?" "Yes."
kw: Yw hi yowynk? Yw.

source: Five plus three is eight.
kw: Pymp ha tri yw eth.

source: Goodnight, Mother.
kw: Nos da, Mamm.

source: It's a new book.
kw: Lyver nowydh yw.

source: The weather is beautiful.
kw: Teg yw an gewer.

source: Is the weather nice?
kw: Yw an gewer hweg?

source: I see the house.
kw: My a wel an chi.

source: I was reading the book.
kw: Yth esen vy ow redya an lyver.

source: Don't leave!
kw: Na wra diberth.

source: You have to go back.
kw: Res yw dhis mos arta.

source: I wrote that book.
kw: My a skrifas an lyver na.

source: Do you like to drive?
kw: Yw da genes lewya?

source: The boy has a newspaper.
kw: Yma paper-nowodhow dhe’n maw.

source: I go to work.
kw: My a wra mos dhe ober.

source: There's a restaurant here.
kw: Yma bosti omma.

source: The boy is eating bread.
kw: Yma’n maw ow tybri bara.

source: I must buy groceries.
kw: Res yw dhymm prena gwara boos.

source: She likes to walk with me.
kw: Da yw gensi kerdhes genev.

source: I heard you.
kw: My a wrug dha glewes.

source: He disliked school.
kw: Drog o ganso skol.

source: She cooks for him.
kw: Hi a gegin ragdho.

source: She is cooking for him.
kw: Yma hi ow kegina ragdho.

source: She used to live with him.
kw: Hi a wre triga ganso.

source: I'm Farshad.
kw: Farshad ov.

source: That's chicken.
kw: Kig yar yw hemma.

source: "Do you want to buy it?" "Yes."
kw: “A vyn’ta y brena?” “Mynnav.”

source: She wanted to understand.
kw: Hi a vynnas konvedhes.

source: I cannot understand it.
kw: Ny allav y gonvedhes.

source: Do you like the city?
kw: Yw da genes an cita?

source: Who's your teacher?
kw: Piw yw dha dhyskador?

source: I had to work on Sunday.
kw: Res o dhymm oberi dy Sul.

source: It is cold.
kw: Yeyn yw hi.

source: Who are you all?
kw: Piw owgh?

source: Don't cry.
kw: Na wra ola.

source: I don't want to eat here.
kw: Ny vynnav vy dybri omma.

source: You can't do that here.
kw: Ny yll'ta gul henna omma.

source: You can't eat here.
kw: Ny yll'ta dybri omma.

source: You can't sleep here.
kw: Ny yll'ta koska omma.

source: I need to buy one.
kw: Res yw dhymm prena onan.

source: I can't fly.
kw: Ny allav vy nejya.

source: I'm 25 years old.
kw: 25 bloodh ov.

source: I want to know.
kw: My a vynn godhvos.

source: I can't drink coffee.
kw: Ny allav vy eva koffi.

source: Does she have a dog? No.
kw: Eus ki dhedhi? Nag eus.

source: This book's new.
kw: An lyver ma yw nowydh.

source: I've got two brothers and a sister.
kw: Yma dhymm dew vroder hag unn hwor.

source: I'm learning Basque.
kw: Yth esov vy ow tyski Baskek.

source: That cat is brown.
kw: Gell yw an gath na.

source: This is a horse.
kw: Margh yw hemma.

source: This dog is mine.
kw: My a bew an ki ma.

source: There wasn't anybody in that room.
kw: Nyns esa den vyth y’n stevel-na.

source: That is my book.
kw: Henn yw ow lyver.

source: How's the dog?
kw: Fatel yw an ki?

source: It was very cold.
kw: Pur yeyn o.

source: I prefer mineral water.
kw: Gwell yw genev dowr ewonek.

source: I have to sleep.
kw: Res yw dhymm koska.

source: What are you doing tomorrow?
kw: Pandr'a wre'ta a-vorow?

source: I don't like your name.
kw: Nyns yw da genev dha hanow.

source: I speak English every day.
kw: My a gews Sowsnek pub dydh.

source: Good job!
kw: Ober da!

source: Google is my teacher.
kw: Google yw ow dyskador.

source: Tom's so old.
kw: Ass yw Tom koth!

source: Tom is very old.
kw: Pur goth yw Tom.

source: Tom has three dogs.
kw: Yma tri hi dhe Tom.

source: Tom has a big family.
kw: Yma teylu bras dhe Tom.

source: Tom doesn't understand French.
kw: Ny gonvedh Tom Frynkek.

source: Tom doesn't like to eat fish.
kw: Nyns yw da gans Tom dybri pysk.

source: Tom doesn't like this.
kw: Nyns yw da gans Tom hemma.

source: Tom doesn't like school.
kw: Nyns yw da gans Tom skol.

source: Tom doesn't like pork.
kw: Nyns yw da gans Tom kig mogh.

source: Tom doesn't like hot food.
kw: Nyns yw da gans Tom boos pooth.

source: Tom doesn't like dogs.
kw: Nyns yw da gans Tom keun.

source: Tom doesn't like coffee with sugar.
kw: Nyns yw da gans Tom koffi gans sugra.

source: Tom doesn't like cats.
kw: Nyns yw da gans Tom kathes.

source: Tom doesn't like beef.
kw: Nyns yw da gans Tom kig bewin.

source: Tom bought a new car.
kw: Tom a brenas carr-tan nowydh.

source: Those are Tom's dogs.
kw: An re na yw keun Tom.

source: This is Tom's dog.
kw: Hemm ky ki Tom.

source: Tom knows Mary's father.
kw: Tom a aswon tas Maria.

source: Come in!
kw: Deus a-ji!

source: What kind of music does Tom like?
kw: Py par ilow yw da gans Tom?

source: This tea is good.
kw: Da yw an te-ma.

source: Where is the school?
kw: Ple'ma an skol?

source: Goodnight!
kw: Nos dha!

source: This house is not very big.
kw: Nyns yw pur vras an chi-ma.

source: I do not want to work.
kw: Ny vynnav oberi.

source: He is similar to your brother.
kw: Ev yw haval orth dha vroder.

source: I'm coming back.
kw: Yth esov vy ow tos arta.

source: He has a headache.
kw: Yma drog penn dhodho.

source: You're pretty.
kw: Teg os ta.

source: I'm reading the newspaper.
kw: Yth esov vy ow redya an paper nowodhow.

source: I can't drink milk.
kw: Ny allav vy eva leth.

source: Tom doesn't like this color.
kw: Nyns yw da gans Tom an liw ma.

source: The dog is beautiful.
kw: Teg yw an ki.

source: That is a boat.
kw: Honn yw skath.

source: That is a ship.
kw: Henn yw gorhel.

source: Do you like tea?
kw: Yw da genes te?

source: I don't like this book.
kw: Nyns yw da genev an lyver ma.

source: Do you like this book?
kw: Yw da genes an lyver ma?

source: I don't like tea.
kw: Nyns yw da genev te.

source: Do you like my friend?
kw: Yw da genes ow howeth?

source: Do you like school?
kw: Yw da genes skol?

source: I'm eating now.
kw: Yth esov vy ow tybri lemmyn.

source: I eat an apple.
kw: My a wra dybri aval.

source: Go there.
kw: Ke ena.

source: Come now.
kw: Deus lemmyn.

source: She was eager to go home.
kw: Mall o gensi mos tre.

source: I wrote the book.
kw: My a skrifas an lyver.

source: "Is your wife British?" "She isn't British, she's Scottish."
kw: “Yw dha wreg Brythones?” “Nag yw, nyns yw Brythones, Albanes yw.”

source: Where is the train?
kw: Ple'ma an tren?

source: Where is the bus?
kw: Ple'ma an kyttrin?

source: I can't go back.
kw: Ny allav vy mos arta.

source: He's not my father.
kw: Nyns yw ow thas.

source: He's my father.
kw: Ow thas yw.

source: Happy birthday, Shishir!
kw: Penn-bloodh lowen, Shishir!

source: You don't have to do this.
kw: Nyns yw res dhis gul hemma.

source: You need to hurry.
kw: Res yw dhis fistena.

source: I had to go.
kw: Res o dhymm mos.

source: How many tractors did you sell last week?
kw: Py lies jynn-tenna a wruss’ta dhe wertha an seythen usi passyes?

source: Do you drink wine?
kw: A wre'ta eva gwin?

source: Why do you study French?
kw: Prag y studhydh Frynkek?

source: I eat.
kw: My a dheber.

source: The sun is big.
kw: Bras yw an howl.

source: I like that.
kw: Da yw genev henna.

source: I don't like that.
kw: Nyns yw da genev henna.

source: You don't have to do it here.
kw: Nyns yw res dhis y wul omma.

source: Do you need to drink wine?
kw: Yw res dhis eva gwin?

source: I need to travel.
kw: Res yw dhymm viajya.

source: I'm a woman.
kw: Benyn ov.

source: We'll have to come back.
kw: Res vydh dhyn dos arta.

source: I sent you a letter.
kw: My a dhanvonas dhis lyther.

source: Are you home?
kw: Esos ta tre?

source: I see the boy.
kw: My a wel an maw.

source: He had a headache.
kw: Yth esa drog penn dhodho.

source: You don't have to do that.
kw: Nyns yw res dhis gul henna.

source: I need to go home.
kw: Res yw dhymm mos tre.

source: I can't swim.
kw: Ny allav vy neuvya.

source: I don't want to work today.
kw: Ny vynnav vy oberi hedhyw.

source: Tom wanted to buy it.
kw: Tom a vynna y brena.

source: Look, it's snowing!
kw: Ott, yma hi ow kul ergh!

source: Where do you see him?
kw: Ple y’n gwelydh?

source: Good.
kw: Da.

source: A leaf is falling.
kw: Yma delen ow kodha.

source: You are watching.
kw: Yth esos ta ow mires orth.

source: They are going.
kw: Yth esons i ow mos.

source: They are watching.
kw: Yth esons i ow mires orth.

source: You are coming.
kw: Yth esos ta ow tos.

source: We are watching.
kw: Yth eson ni ow mires orth.

source: Go!
kw: Ke!

source: See you.
kw: Dha weles.

source: Today is Thursday.
kw: dy'Yow yw hedhyw.

source: Today is Friday.
kw: dy'Gwener yw hedhyw.

source: It is my dog.
kw: Ow hi yw.

source: I prefer to say.
kw: Gwell yw genev leverel.

source: I am lost.
kw: Kellys ov.

source: Tom lit the fire.
kw: Tom a enowis an tan.

source: I want to learn.
kw: My a vynn dyski.

source: I am loved by my mother.
kw: Kerys ov gans ow mamm.

source: These are his pens.
kw: An re ma yw y bluvennow.

source: I will have to work on Sunday.
kw: Res vydh dhymm oberi dy Sul.

source: I can run.
kw: My a yll ponya.

source: Do I have to go now?
kw: Yw res dhymm mos lemmyn?

source: Tom has a big problem.
kw: Yma kudyn bras dhe Tom.

source: Do you want to kill me?
kw: A vyn’ta ow ladha?

source: It snowed.
kw: Hi a wrug ergh.

source: Hurry!
kw: Fisten!
